KEYWORDS = [

    # -----------------
    # کنکور
    # -----------------

    "کنکور",
    "آزمون سراسری",
    "سازمان سنجش",
    "انتخاب رشته",
    "نتایج کنکور",
    "ثبت نام کنکور",
    "سوابق تحصیلی",
    "معدل",
    "تاثیر معدل",
    "تأثیر معدل",
    "سهمیه",


    # -----------------
    # دانشگاه
    # -----------------

    "دانشگاه",
    "دانشجویان",
    "دانشجو",
    "کارشناسی",
    "کارشناسی ارشد",
    "دکتری",
    "پذیرش",
    "ثبت نام دانشگاه",
    "آزمون ارشد",
    "آزمون دکتری",
    "هیئت علمی",
    "اساتید",
    "عضو هیئت علمی",


    # -----------------
    # مدارس
    # -----------------

    "مدرسه",
    "مدارس",
    "آموزش و پرورش",
    "وزارت آموزش و پرورش",
    "امتحانات",
    "امتحان نهایی",
    "امتحانات نهایی",
    "تعطیلی مدارس",
    "تعطیلی مدرسه",
    "غیرحضوری",
    "حضوری",


    # -----------------
    # سمپاد
    # -----------------

    "تیزهوشان",
    "سمپاد",
    "نمونه دولتی",
    "آزمون تیزهوشان",
    "آزمون سمپاد",
    "المپیاد",


    # -----------------
    # اخبار آموزشی
    # -----------------

    "ثبت‌نام",
    "ثبت نام",
    "آزمون",
    "کارت ورود به جلسه",
    "نتایج",
    "قبولی",
    "مصوبه",
    "مصوبات",
    "قانون",
    "اطلاعیه",
    "سال تحصیلی",
    "تقویم آموزشی",

]



# اخبار غیرمرتبط
BLOCKED_KEYWORDS = [

    # ورزش
    "فوتبال",
    "ورزش",
    "لیگ",
    "پرسپولیس",
    "استقلال",
    "تراکتور",
    "سپاهان",
    "بازیکن",
    "مربی",
    "گل",
    "مسابقه",
    "قهرمانی",
    "والیبال",
    "بسکتبال",
    "کشتی",
    "تکواندو",
    "وزنه برداری",


    # سیاست و بین الملل
    "جنگ",
    "حمله",
    "رئیس جمهور",
    "انتخابات",
    "مجلس",
    "وزیر خارجه",
    "دیپلمات",
    "دانلود",
    "قلمچی",
    "کانون فرهنگی آموزش",
    "نمونه سوال",
    "جزوه",

    # حوادث و جرم
    "تصادف",
    "قتل",
    "سرقت",
    "بازداشت",
    "حادثه",
    "زلزله",


    # اقتصاد غیرآموزشی
    "بورس",
    "ارز",
    "دلار",
    "طلا",
    "سهام",

]



def is_relevant(title, summary=""):

    text = f"{title} {summary}".lower()


    # اول حذف موارد ممنوع
    for word in BLOCKED_KEYWORDS:

        if word.lower() in text:
            return False


    # بعد بررسی موضوع آموزشی
    for keyword in KEYWORDS:

        if keyword.lower() in text:
            return True


    return False