SOURCES = [

    # -------------------------
    # خبرگزاری ایسنا
    # -------------------------

    {
        "name": "ایسنا - دانشگاه و آموزش",
        "url": "https://www.isna.ir/rss/tp/150"
    },


    # -------------------------
    # خبرگزاری مهر
    # -------------------------

    {
        "name": "مهر - آموزش و دانشگاه",
        "url": "https://www.mehrnews.com/rss/tp/14"
    },

    {
        "name": "مهر - دانشگاه",
        "url": "https://www.mehrnews.com/rss/tp/20"
    },


    # -------------------------
    # ایرنا
    # -------------------------

    {
        "name": "ایرنا - آموزش",
        "url": "https://www.irna.ir/rss/tp/17"
    },


    # -------------------------
    # وزارت آموزش و پرورش
    # -------------------------

    {
        "name": "پانا - آموزش و پرورش",
        "url": "https://www.pana.ir/rss"
    },


    # -------------------------
    # خبرگزاری دانشجو
    # -------------------------

    {
        "name": "خبرگزاری دانشجو - دانشگاه",
        "url": "https://snn.ir/fa/rss"
    },


    # -------------------------
    # دانشگاه آزاد
    # -------------------------

    {
        "name": "دانشگاه آزاد اسلامی",
        "url": "https://iau.ir/fa/rss"
    },


    # -------------------------
    # منابع کنکور
    # -------------------------

    {
        "name": "کنکور - اخبار آزمون",
        "url": "https://www.konkur.in/feed"
    },


 
]